Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P01.tmx
Source language: en_us
Languages: zh_cn

source: Ash
zh_cn: 灰

source: We'll still be friends, she said.
zh_cn: 我们还会是朋友，她说。

source: - Grand, he answered, and then he was walking down a street by himself, before he fully understood what had happened.
zh_cn: ——很好，他回答道，然后在他完全弄明白发生了什么事之前，他一个人沿着街道走去。

source: He knew the street, although not very well.
zh_cn: 他认识这条街，尽管不怎么熟悉。

source: He wasn't sure why he was there, why they'd gone over to this part of the city.
zh_cn: 他不确定他为什么在那里，他们为什么跑到了城市的这一地区。

source: His wife had just told him she was leaving him.
zh_cn: 他妻子刚刚告诉他她要离开他。

source: Or he was leaving her.
zh_cn: 或者他要离开她。

source: One or the other.
zh_cn: 不是这个就是那个。

source: And they'd still be friends.
zh_cn: 而且他们还会是朋友。

source: Grand.
zh_cn: 很好。

source: He made it home.
zh_cn: 他回家了。

source: He got the Dart, figured out how to get a one-way ticket out of the vending machine at the station.
zh_cn: 他到了都柏林快铁站，弄清楚怎么从车站里的自动售票机上买到一张单程票。

source: He'd left the car for his wife.
zh_cn: 他把车留给了他妻子。

source: She wasn't there when he got in.
zh_cn: 他上车时她不在那里。

source: He paid the babysitter.
zh_cn: 他给临时来照看孩子的保姆付了钱。

source: Later, Ciara came home.
zh_cn: 稍后，西亚拉（Ciara）会家了。

source: And she was all over him.
zh_cn: 并且她整个人趴在他身上。

source: She climbed onto him and cried as she came.
zh_cn: 她爬到他身上，而且她来时哭了。

source: - I'm so, so sorry.
zh_cn: ——真的很对不起。

source: And that was that, he thought, if it had ever been anything in the first place.
zh_cn: 那确实如此，他想，如果起初曾经有过什么事的话。

source: He didn't want to ask her if she'd actually told him that she was leaving him.
zh_cn: 他不想问她她是不是真的跟他说过她要离开他。

source: He knew she had.
zh_cn: 他知道她说过。

source: It didn't matter.
zh_cn: 这没关系。

source: - You'll be fine, she said, after she'd kissed his stomach and lay tucked in beside him.
zh_cn: ——你会没事的，在吻了吻他的肚子并钻进被窝躺在他旁边之后她说。

source: He'd passed a test, or something.
zh_cn: 他通过了一项考试，或什么东西。

source: He was delighted.
zh_cn: 他很高兴。

source: She was gone in the morning.
zh_cn: 到早上她已经走了。

source: He went to work.
zh_cn: 他去上班。

source: The house was empty when he got home after collecting the girls.
zh_cn: 他接了女儿回到家时，家里没人。

source: He thought, This is it, this is me.
zh_cn: 他想，就是这样的，这就是我。

source: I live alone.
zh_cn: 我一个人生活。

source: With the kids.
zh_cn: 和孩子们一起。

source: She'd taken nothing.
zh_cn: 她什么也没拿走。

source: The bedroom was exactly the same.
zh_cn: 卧室完全是老样子。

source: Her book was still beside the bed.
zh_cn: 她的书还在床旁边。

source: She came in very late.
zh_cn: 她回来得很晚。

source: He wasn't sure- he didn't know- if she'd changed her mind or if she'd just come home later than usual.
zh_cn: 他不确定——他不知道——她是改主意了还是她只是比平时回来得晚。

source: She was drunk- he didn't ask.
zh_cn: 她喝醉了——他没问。

source: She rode him again, said nothing about being sorry this time.
zh_cn: 她又一次与他XXOO，这次没有说什么对不起。

source: She didn't cry.
zh_cn: 她没哭。

source: Then she was gone again.
zh_cn: 然后她又走了。

source: He put Erica and Wanda to bed again the next night, made them brush their teeth, read a story to them.
zh_cn: 第二天晚上他再一次安顿埃里卡（Erica）和旺达（Wanda）上床睡觉，叫她们刷牙，给她们读故事。

source: "Kipper's Toybox," twice.
zh_cn: “奇普的玩具箱”，两次。

source: - Where's Mammy?
zh_cn: ——妈咪在哪里？

source: - Work.
zh_cn: ——工作。

source: - Poor Mammy.
zh_cn: ——可怜的妈咪。

source: - Yeah.
zh_cn: ——是啊。

source: He turned off their light and made sure their bedroom door was open exactly as wide as they wanted it.
zh_cn: 他关掉她们的灯，确保她们卧室的门打开的幅度恰是她们想要的。

source: - More.
zh_cn: ——再多一点。

source: - No, stop.
zh_cn: ——不，停下。

source: He went downstairs.
zh_cn: 他下楼。

source: Ciara didn't come in.
zh_cn: 西亚拉没回来。

source: He put the mobile phone beside him, on the arm of the chair.
zh_cn: 他把手机放在他旁边，放在椅子的扶手上。

source: He watched telly.
zh_cn: 他看电视。

source: He slept.
zh_cn: 他睡了。

source: She didn't phone.
zh_cn: 她没打来电话。

source: He went up to the bed.
zh_cn: 他上楼去睡。

source: He turned off the light.
zh_cn: 他关掉灯。

source: He woke up.
zh_cn: 他醒了。

source: She wasn't there.
zh_cn: 她不在。

source: Three in the morning.
zh_cn: 凌晨三点。

source: And she wasn't downstairs.
zh_cn: 她也不在楼下。

source: He went back up to the bed but he didn't sleep.
zh_cn: 他回楼上上床但他没睡。

source: He went down to the kitchen again.
zh_cn: 他又下楼去厨房。

source: He accepted it as he put the coffee on the hob: She's left me.
zh_cn: 他把咖啡放在铁架上时他接受了：她离开我了。

source: You think she has? said his brother, Mick.
zh_cn: 你认为她已经走了？他兄弟米克（Mick）说。

source: - You think? said Mick.
zh_cn: ——你认为？米克说。

source: They were in the kitchen.
zh_cn: 他们在厨房里。

source: - Well, like. Did she actually tell you she was leaving?
zh_cn: ——哦，那个，她真的告诉你她要离开？

source: - Yeah, he said.
zh_cn: ——是的，他说。

source: I think so.
zh_cn: 我想是这样的。

source: - You fuckin' think so?
zh_cn: ——你他妈的想是这样的？

source: Jesus, Kev, you can fuckin' do better than that.
zh_cn: 天啊，凯文，你他妈的能做得更好点。

source: - She told me.
zh_cn: ——她跟我说的。

source: - Grand. And what happened then?
zh_cn: ——很好，然后又发生了什么事？

source: - She rode the arse off me.
zh_cn: ——她和我XXOO。

source: - Strange, said Mick.
zh_cn: ——奇怪，米克说。

source: But it makes sense, too.
zh_cn: 但也有意义。

source: The long goodbye.
zh_cn: 长长的告别。

source: The ride of the guilty. You've heard of it.
zh_cn: 内疚的XXOO，你听说过的。

source: - No.
zh_cn: ——没有。

source: - It's brilliant, said Mick.
zh_cn: ——精彩，米克说。

source: I recommend it.
zh_cn: 赞一个。

source: What happened then?
zh_cn: 然后发生了什么事？

source: - I think she went to work.
zh_cn: ——我想她去上班了。

source: - Is she riding anyone else?
zh_cn: ——她在和其他什么人XXOO吗？

source: The question shocked him. Although it shouldn't have.
zh_cn: 这个问题使他震惊，尽管本不该。

source: It annoyed him, the invasion.
zh_cn: 这使他气恼，那个入侵。

source: And frightened him.
zh_cn: 并使他害怕。

source: - I don't think so, he said.
zh_cn: ——我想不是这样的，他说。

source: - Think again.
zh_cn: ——再想想。

source: - As far as I know.
zh_cn: ——就我所知。

source: - O.K.
zh_cn: ——好吧。

source: - How would I know?
zh_cn: ——我怎么会知道？

source: - Well, said Mick.
zh_cn: ——噢，米克说。

source: She might have told you.
zh_cn: 她可能告诉过你。

source: - Sure?
zh_cn: ——确定？

source: I think so- no- yeah.
zh_cn: 我想是的——不——是的。

source: - O.K., said Mick.
zh_cn: ——好吧，米克说。

source: Credit-card statements.
zh_cn: 信用卡账单。

source: - Hang on, said Kevin.
zh_cn: ——等一下，凯文说。

source: It's the man who always gets caught because of his credit card.
zh_cn: 就是那个总是因为他的信用卡而被抓的人。

source: Am I right?
zh_cn: 我说的对吗？

source: Mick shrugged.
zh_cn: 米克耸耸肩。

source: - Does she have her own card?
zh_cn: ——她有自己的信用卡吗？

source: - Yeah, said Kevin.
zh_cn: ——有，凯文说。

source: Course.
zh_cn: 当然。

source: - So, let's have a gawk.
zh_cn: ——那么，就看一下吧。

source: It can do no harm.
zh_cn: 不会有什么害处。

source: Kevin was starting to dislike his brother, but this wasn't a new feeling.
zh_cn: 凯文开始厌恶他兄弟，但这不是一种新的情感。

source: - No, he said.
zh_cn: ——不，他说。

source: Mick shrugged again.
zh_cn: 米克又耸耸肩。

source: He was a cunt for the shrugging.
zh_cn: 就耸肩来说，他就是一个王八蛋。

source: - O.K., he said.
zh_cn: ——好吧，他说。

source: He stood up.
zh_cn: 他站起来。

source: He had to go to their mother's.
zh_cn: 他得去他们妈妈那里。

source: - She's complaining about the jacks.
zh_cn: ——她在抱怨厕所。

source: - She's always complaining.
zh_cn: ——她总是抱怨。

source: - Ah, she's not the worst, said Mick.
zh_cn: ——哈，她还不是最差的，米克说。

source: It won't turn off properly, or something.
zh_cn: 水关不掉，还是什么事来着。

source: - The toilet?
zh_cn: ——抽水马桶？

source: - Yeah, said Mick.
zh_cn: ——是的，米克说。

source: She says it sounds like the cistern is talking to her when she's downstairs and it's upstairs.
zh_cn: 她说她在楼下水箱在楼上时，听起来好像它在跟她说话。

source: - It's always upstairs.
zh_cn: ——它一直在楼上。

source: It's attached to the fuckin' wall.
zh_cn: 放在他妈的墙上。

source: - You're becoming a very bitter little man, Kev.
zh_cn: ——你正在变成一个十足的充满怨气的小男人，凯文。

source: - Fuck off, Mick.
zh_cn: ——滚蛋，米克。

source: - This is me fucking off, said Mick as he walked to the back door.
zh_cn: ——我这就滚蛋，他一边走向后门一边说。

source: Away, to have a chat with our mother's toilet.
zh_cn: 远远的，和我们老妈的卫生间聊天去。

source: What a fuckin' life.
zh_cn: 什么他妈的生活。

source: Good luck.
zh_cn: 祝你好运。

source: Kevin took out the accordion file where they kept the bank statements, the insurance stuff, birth certificates, and all the other crap they were supposed to keep.
zh_cn: 凯文拿出他们放银行帐单、保险资料、出生证明和所有其它他们必需要保存的废物的那本折叠式文件夹。

source: It was in the wardrobe, at the back, behind her shoes and boots, a heap of the things.
zh_cn: 它在衣橱里，在后面，在她的鞋和靴子后面，一堆的东西。

source: He sat on the bed and held one of her high heels as he looked at a recent statement.
zh_cn: 他坐在床上，拿着她的一只高跟鞋看一份最近的帐单。

source: He put the page on a pillow, propped a bit, and he read it from a distance.
zh_cn: 他把这张纸放在一个枕头上，支起一点，离得远远地读。

source: He didn't really read it- you couldn't read a bank statement.
zh_cn: 他没有真的读——你不能读银行帐单。

source: He gave it a quick look; he glanced down the page.
zh_cn: 他迅速地瞄了一眼；他粗略地看了一下那张纸。

source: - Why are you holding Mammy's shoe?
zh_cn: ——你为什么拿着妈咪的鞋？

source: It was Erica, the younger one.
zh_cn: 是埃里卡，小的那个。

source: - What makes you think it's Mammy's shoe?
zh_cn: ——你为什么认为这是妈咪的鞋？

source: He hadn't a clue why he'd said that.
zh_cn: 他不明白他为什么这么说。

source: - It is, said Erica.
zh_cn: ——它就是，埃里卡说。

source: - You're right, said Kevin.
zh_cn: ——你说的对，凯文说。

source: It was on the floor.
zh_cn: 它在地板上。

source: Do you want to put it back?
zh_cn: 你想把它放回去吗？

source: - Can I, like, wear them?
zh_cn: ——我能，比如，穿穿它们吗？

source: - Yeah, all right.
zh_cn: ——能，当然。

source: - Can Wanda?
zh_cn: ——旺达能吗？

source: - Wanda!
zh_cn: ——旺达！

source: He left the girls in the bedroom lining up the shoes.
zh_cn: 他把女孩们留在卧室里排鞋子。

source: - That's right.
zh_cn: ——没错。

source: - Always working.
zh_cn: ——总是工作。

source: - Now you're talking.
zh_cn: ——现在你在说话。

source: - Nothing, he said, when Mick answered his mobile.
zh_cn: ——什么也没有，在米克接通手机时他说。

source: - What?
zh_cn: ——什么？

source: - I looked.
zh_cn: ——我看了。

source: There's nothing on the credit-card statement.
zh_cn: 信用卡账单上什么也没有。

source: - Nothing incriminating, no?
zh_cn: ——没任何罪证，没有？

source: - Jesus, Mick, take it easy.
zh_cn: ——天啊，米克，放轻松。

source: What were you looking for?
zh_cn: 你找的是什么？

source: - I don't know, said Kevin.
zh_cn: ——我不知道，凯文说。

source: He was regretting he'd called Mick now.
zh_cn: 他现在在后悔给米克打了电话。

source: Big time.
zh_cn: 真是好时候。

source: But he'd had to.
zh_cn: 但他不得不这样做。

source: - A name or something, he said.
zh_cn: ——一个名字或什么东西，他说。

source: - A name? said Mick.
zh_cn: ——一个名字？米克说。

source: What name?
zh_cn: 什么名字？

source: D'you think she's paying whoever she's having the affair with?
zh_cn: 你认为她在付钱给和她有一腿的那个谁？

source: What affair?
zh_cn: 什么有一腿？

source: - Or it's a rent boy or something?
zh_cn: ——或者是男妓什么的？

source: She has to pay someone to-
zh_cn: 她得付钱给什么人来——

source: Fuck off.
zh_cn: 滚蛋。

source: - Any restaurants?
zh_cn: ——任何餐馆？

source: - Hotels?
zh_cn: ——宾馆？

source: - He's paying, so.
zh_cn: ——他在付钱，这么说。

source: - Who?
zh_cn: ——谁？

source: - The rent boy.
zh_cn: ——那个男妓。

source: - Stranger things have happened, man.
zh_cn: ——更奇异的事都发生过了，哥们。

source: People go off the rails in times of recession.
zh_cn: 人们在不景气时出轨。

source: Especially women.
zh_cn: 特别是女人。

source: - What are you on about?
zh_cn: ——你在说什么？

source: - The moral compass, man, said Mick.
zh_cn: ——道德标准，哥们，米克说。

source: They try to ride the fuckin' thing.
zh_cn: 他们试图乱搞。

source: - Good night.
zh_cn: ——晚安。

source: Mick texted him.
zh_cn: 米克给他发短信。

source: Hav u foned hr?
zh_cn: 给她打过电话吗？

source: No.
zh_cn: 没有。

source: Wy not?
zh_cn: 为什么不？

source: He phoned Mick.
zh_cn: 他打电话给米克。

source: - Because I'm frightened.
zh_cn: ——因为我害怕。

source: I'm with you.
zh_cn: 我明白。

source: Mick wasn't the worst, Kevin thought.
zh_cn: 米克还不是最差的，凯文想。

source: - What would you do? he asked.
zh_cn: ——你要怎么做？他问。

source: - Well, look it, man, said Mick.
zh_cn: ——哦，你看，哥们，米克说。

source: Just to remind you.
zh_cn: 只是提醒你。

source: I live in a poxy one-room flat because I had a short, meaningless fling with my son's religion-and-civics teacher, who gave him a note to give to me and he- and I love my son, I blame only myself- he gave the note to his mother instead.
zh_cn: 我住在一间廉价的一居室公寓里是因为我和我儿子的宗教-和-公民学老师有一段短短的毫无意义的风流事，她给他一封短信要交给我但他——我爱我儿子，我只怪我自己——他却把这封短信给了他妈妈。

source: Who read it, and it said-
zh_cn: 她看了信，信上说——

source: - I know.
zh_cn: ——我知道。

source: - You can do it to me that way next time.
zh_cn: ——你下次可以对我这么做。

source: - I know, sorry.
zh_cn: ——我知道，对不起。

source: - Ten words that shook the fuckin' world.
zh_cn: ——震动了他妈的世界的十个字。

source: They were enjoying themselves.
zh_cn: 他们很快活。

source: - And you want to know what I'd do if I was in your position?
zh_cn: ——想知道如果我在你这种情况下我会怎么做吗？

source: I do.
zh_cn: 我真的想。

source: - Grand, said Mick.
zh_cn: ——很好，米克说。

source: I haven't a clue.
zh_cn: 我一点头绪都没有。

source: - Good night, Mick.
zh_cn: ——晚安，米克。

source: - Go a bit mad.
zh_cn: ——稍微疯一下。

source: - Thanks.
zh_cn: ——谢谢。

source: - You asked.
zh_cn: ——你问了。

source: - How?
zh_cn: ——怎么做？

source: - How what?
zh_cn: ——什么怎么做？

source: - How would I go mad?
zh_cn: ——我怎么疯？

source: - Wife swapping.
zh_cn: ——换妻。

source: - I'd need a wife.
zh_cn: ——我还得需要一个妻子。

source: - True.
zh_cn: ——正确。

source: - Let me work on it.
zh_cn: ——让我再想想。

source: - I'll get back to you.
zh_cn: ——我再打给你。

source: He went to his room- their room- and started throwing the shoes back into the wardrobe.
zh_cn: 他去他的房间——他们的房间——开始把鞋子扔回衣橱里。

source: - Excuse me!
zh_cn: ——对不起！

source: It was Erica.
zh_cn: 是埃里卡。

source: - We're, like, trying to sleep in here!
zh_cn: ——我们，嗯，想睡在这里。

source: - Yeah!
zh_cn: ——好！

source: - Sorry.
zh_cn: ——对不起。

source: He got down on his knees and put the shoes and boots away, quietly.
zh_cn: 他跪下来，把鞋和靴子放好，静静地。

source: He piled them.
zh_cn: 他把它们堆起来。

source: The wardrobe door swung slowly toward him, and with it the full-length mirror.
zh_cn: 衣橱门慢慢向他转过来，和它一起的是那面全身的镜子。

source: He looked, and saw nothing.
zh_cn: 他看看，什么也没看到。

source: He wasn't there.
zh_cn: 他不在那里。

source: He pushed the door back slightly.
zh_cn: 他轻轻把门推回去。

source: And there he was.
zh_cn: 他在那里了。

source: He got into bed.
zh_cn: 他上了床。

source: He phoned her.
zh_cn: 他给她打电话。

source: Her voicemail was gone.
zh_cn: 她的语音信箱没了。

source: It was the automated voice, the Vodafone woman, telling him to leave a message.
zh_cn: 是自动化的声音，沃达丰（Vodafone）女人，叫他留言。

source: He had nothing ready and he couldn't think of anything he wanted to say out loud- The kids miss you; I miss you; Where the fuck are you, you stupid mad bitch of a cunt?- so he said nothing.
zh_cn: 他没准备什么，他也想不出他要大声说出什么——孩子想你；我想你；你他妈在哪儿，你这又蠢又疯的混蛋婊子？——所以他什么也没说。

source: Mick texted.
zh_cn: 米克发来短信。

source: Jcksns, snday.
zh_cn: 杰克逊，周日。

source: Jackson's was a pub near Mick's place.
zh_cn: 杰克逊是一家离米克住所不远的酒馆。

source: It was an ordinary pub six nights a week but on Sundays, according to Mick, it changed.
zh_cn: 一个星期里有六晚它是一家普通酒馆，但是在星期天，照米克所说，它就变了。

source: It filled up with men- n wmn- of a certain age, who were no longer married or had never been married.
zh_cn: 里面挤满了男人——没女人——有一定岁数的，他们离婚了或从没结过婚。

source: - People like you.
zh_cn: ——像你一样的人。

source: - Exactly, said Mick.
zh_cn: ——对，米克说。

source: - And that's going wild, is it? said Kevin.
zh_cn: ——那就是发疯，是吗？凯文说。

source: Going to a pub full of Micks?
zh_cn: 去一个满是爱尔兰佬的酒馆？

source: They were laughing.
zh_cn: 他们大笑。

source: - Works for me, said Mick.
zh_cn: ——对我有用，米克说。

source: No one goes home empty-handed.
zh_cn: 没人空手回家。

source: - Lovely, said Kevin.
zh_cn: ——有趣，凯文说。

source: I can't wait.
zh_cn: 我等不及了。

source: - I'm telling yeh, man, said Kevin.
zh_cn: ——我跟你说，哥们，凯文说。

source: I went home the last time with fifty-seven-year-old twins.
zh_cn: 我上次带一对五十七岁的双胞胎回家。

source: - Oh, Jesus.
zh_cn: ——哦，天啊。

source: - Combined age, one hundred and fourteen.
zh_cn: ——年龄加在一起，一百一十四。

source: - Next Sunday, so.
zh_cn: ——下星期天，那就这样。

source: - No, fuck off.
zh_cn: ——不，滚开。

source: I'll think about it.
zh_cn: 我要想想。

source: - Do that.
zh_cn: ——想想吧。

source: He did think about it.
zh_cn: 他真的想了想。

source: Sunday was four days away.
zh_cn: 离星期天还有四天。

source: He'd need a babysitter.
zh_cn: 他需要个临时来照顾孩子的保姆。

source: The young one from next door. Grace.
zh_cn: 隔壁的年轻人，格雷斯（Grace）。

source: The girls loved her.
zh_cn: 女儿们喜欢她。

source: He could only stay out till eleven, because Grace would have school on Monday.
zh_cn: 他只能在外面待到十一点，因为格雷斯星期一要上课。

source: That would give him two hours in Jackson's. Two hours of abandonment.
zh_cn: 那可以使他在杰克逊待上两个小时。两小时的放纵。

source: Then he'd have to come home.
zh_cn: 然后他得回家。

source: He'd come into the house and pay Grace, while Mick's twins hid behind the car till the coast was clear.
zh_cn: 他要进屋并给格雷斯付钱，同时米克的双胞胎藏在车后直到没有被发现的危险。

source: Or he could sneak them up the stairs then go back down to pay Grace and send her home.
zh_cn: 或者他能偷偷地把他们带到楼上，然后再下楼付钱给格雷斯并把她送回家。

source: Or he'd sneak them up the stairs- they'd be pissed and too skinny and giggling- into the bedroom, and Ciara would be in the bed, waiting for him.
zh_cn: 或者他会偷偷地把他们带到楼上——他们喝醉了、太轻佻了、哈哈大笑——进到卧室去，西亚拉会在床上，等他。

source: He'd sneak them up the stairs, send Grace home, then stand at the bottom of the stairs, all night, till he could go to work.
zh_cn: 他会偷偷把他们带到楼上，把格雷斯送回家，然后站在楼梯底端，整夜，直到他能去上班。

source: He'd sneak them up the stairs, and- he could see this now; he groaned- they'd go into the wrong room and wake Erica and Wanda.
zh_cn: 他会偷偷把他们带到楼上，并且——他现在能看到；他呻吟着——他们会走错房间，惊醒埃里卡和旺达。

source: Oops!
zh_cn: 唉呀！

source: Or, he'd go to Jackson's, have three pints, and come home.
zh_cn: 或者，他会去杰克逊，喝上三品脱，然后回家。

source: Mad.
zh_cn: 疯了。

source: Wild.
zh_cn: 疯狂。

source: It wasn't funny.
zh_cn: 这没趣。

source: He'd stop at the chipper on the way home.
zh_cn: 回家的路上他会在卖炸鱼和炸薯条的店停一下。

source: He wasn't going anywhere on Sunday.
zh_cn: 星期天他什么地方也不去。

source: Mick and his fuckin' twins.
zh_cn: 米克和他妈的双胞胎。

source: He woke before Ciara got into the bed.
zh_cn: 在西亚拉上床前他醒了。

source: - Hi, she said.
zh_cn: ——嗨，她说。

source: - Hi.
zh_cn: ——嗨。

source: - I don't want to have sex with you.
zh_cn: ——我不想和你XXOO。

source: - Fine.
zh_cn: ——好的。

source: She climbed in.
zh_cn: 她爬上床。

source: He didn't have to move.
zh_cn: 他不用动。

source: He was lying on his side of the bed.
zh_cn: 他躺在床上他的那一侧。

source: She lay back, and turned.
zh_cn: 她躺下，翻身。

source: She put her hand on his shoulder.
zh_cn: 她把手放在他肩上。

source: She patted it- he thought she did.
zh_cn: 她拍了拍——他想她拍了。

source: He felt her breath.
zh_cn: 他感到她的呼吸。

source: He could smell it. No wine or anything- just toothpaste.
zh_cn: 他能闻到，没有酒味什么的——只是牙膏味。

source: He was asleep before her- he thought he was.
zh_cn: 他在她之前睡着了——他想他是的。

source: And she was there when he woke.
zh_cn: 并且他醒来时她还在那里。

source: She came into the kitchen. The girls were still asleep.
zh_cn: 她走进厨房，女孩们还在睡觉。

source: They'll be delighted to see you.
zh_cn: 看到你她们会很高兴。

source: It was business as usual, although they managed to avoid touching or looking at one another.
zh_cn: 一切如常，尽管他们设法避免彼此接触或看对方。
